Tsar/smart_home/ESP8266_Firmware/src/main.cpp
// Same as WiFi.disconnect(true), but without touching config
void disconnectWiFi() {
    if (WiFi.getMode() & WIFI_STA) {
      wifi_station_disconnect();
    }
    WiFi.enableSTA(false);
}

void rejoinMulticastGroup() {
  const auto& ip = WiFi.localIP();
  igmp_leavegroup(ip, UDP_MULTICAST_IP);
  igmp_joingroup(ip, UDP_MULTICAST_IP);
}

void enableAccessPoint() {
  if (isAccessPointEnabled) return;

  uint8_t mac[WL_MAC_ADDR_LENGTH];
  WiFi.macAddress(mac);
  char softAPName[32] = {};
  sprintf(softAPName, "SmartHomeDevice_%02X%02X%02X", mac[3], mac[4], mac[5]);

  const bool result = WiFi.softAP(softAPName, "setup12345");
  if (!result) {
    fastBlinkForever();
    return;
  }

  digitalWrite(LED_BUILTIN, LOW);
  isAccessPointEnabled = true;
}

bool connectToWiFi(const char* ssid, const char* passphrase, bool connectInfinitely) {
  digitalWrite(LED_BUILTIN, LOW);
  udp.stop();

  WiFi.begin(ssid, passphrase);

  wifiConnectResult = WiFi.waitForConnectResult(30000);
  while (wifiConnectResult != WL_CONNECTED) {
    if (!connectInfinitely) {
      return false;
    }
    delay(1000);  // making delay for part of wait, because sometimes waitForConnectResult exits immediately
    wifiConnectResult = WiFi.waitForConnectResult(9000);
  }

  const auto& ip = WiFi.localIP();
  digitalWrite(LED_BUILTIN, HIGH);

  // This should partly help for quick responses, details: https://github.com/esp8266/Arduino/issues/6886
  experimental::ESP8266WiFiGratuitous::stationKeepAliveSetIntervalMs();

  const bool listeningMulticast = udp.beginMulticast(ip, UDP_MULTICAST_IP, UDP_MULTICAST_PORT);
  if (listeningMulticast) {
    rejoinMulticastGroupTicker.detach();
    rejoinMulticastGroupTicker.attach_ms_scheduled(REJOIN_MULTICAST_GROUP_INTERVAL, rejoinMulticastGroup);
  }

  return true;
}

bool checkPassword() {
  if (server.hasHeader("Password") && server.header("Password") == homeCfg.getPassword()) {
    return true;
  }
  server.send(403, "text/plain", "Forbidden");
  return false;
}

void sendBadRequest() {
  server.send(400, "text/plain", "Bad Request");
}

// Create JSON (inefficient function, only for manual debugging)
String generateInfoJson(bool minimal) {
  String result = "{\n  \"mac\": \"" + WiFi.macAddress()
              + "\",\n  \"name\": \"" + homeCfg.getName()
              + "\",\n  \"firmware_version\": " + String(FIRMWARE_VERSION);
  if (!minimal) {
    result += ",\n  \"values\": {\n    \"";
    for (uint8_t i = 0; i < DIMMERS_COUNT; ++i) {
      result += DIMMER_PREFIX + String(i) + "\": " + String(homeCfg.getDimmerValue(i)) + ",\n    \"";
    }
    for (uint8_t i = 0; i < SWITCHERS_COUNT; ++i) {
      result += SWITCHER_PREFIX + String(i) + "\": " + (homeCfg.getSwitcherValue(i) ? "1" : "0") + (i + 1 == SWITCHERS_COUNT ? "" : ",\n    \"");
    }
    result += "\n  },\n  \"micros\": {\n    \"";
    for (uint8_t i = 0; i < DIMMERS_COUNT; ++i) {
      const uint16_t value = homeCfg.getDimmerValue(i);
      result += DIMMER_PREFIX + String(i) + "\": " + String(value > 0 ? dimmerValueToMicros(value, i) : -1) + (i + 1 == DIMMERS_COUNT ? "" : ",\n    \"");
    }
    result += "\n  },\n  \"dimmers_settings\": {\n    \"";
    for (uint8_t i = 0; i < DIMMERS_COUNT; ++i) {
      result += DIMMER_PREFIX + String(i) + "\": {\n      \"value_change_step\": " + String(dimmersSettings[i].valueChangeStep)
                                              + ",\n      \"min_lightness_micros\": " + String(dimmersSettings[i].minLightnessMicros)
                                              + ",\n      \"max_lightness_micros\": " + String(dimmersSettings[i].maxLightnessMicros)
                                              + "\n    }" + (i + 1 == DIMMERS_COUNT ? "" : ",\n    \"");
    }
    result += "\n  },\n  \"dimmer_value_after_boot\": " + String(homeCfg.getDimmerValueAfterBoot()) + ",\n  \"switchers_inverted\": {\n    \"";
    for (uint8_t i = 0; i < SWITCHERS_COUNT; ++i) {
      result += SWITCHER_PREFIX + String(i) + "\": " + (homeCfg.isSwitcherInverted(i) ? "1" : "0") + (i + 1 == SWITCHERS_COUNT ? "" : ",\n    \"");
    }
    result += "\n  },\n  \"switcher_value_after_boot\": " + String(homeCfg.getSwitcherValueAfterBoot()) + ",\n  \"additional_blob\": \"";
    const String& additionalBlob = homeCfg.getAdditionalBlob();
    for (unsigned int i = 0; i < additionalBlob.length(); ++i) {
      result += String(additionalBlob[i], 16) + (i + 1 == additionalBlob.length() ? "" : " ");
    }
    const auto currentUptime = millis();
    result += "\",\n  \"uptime_ms\": " + String(currentUptime)
            + ",\n  \"input_falls_count\": " + String(inputFallsCount)
            + ",\n  \"average_input_fall_interval_ms\": " + String(static_cast<double>(currentUptime) / inputFallsCount, 5);
  }
  result += "\n}\n";
  return result;
}

class UnalignedBinarySerializer {
public:
  UnalignedBinarySerializer(char* buffer) : buffer_(buffer), pos_(0) {}

  void writeWiFiMacAddress() {
    WiFi.macAddress(reinterpret_cast<uint8_t*>(buffer_ + pos_));
    pos_ += WL_MAC_ADDR_LENGTH;
  }

  void writeUInt8(uint8_t value) {
    buffer_[pos_++] = value;
  }

  void writeUInt16(uint16_t value) {
    memcpy(buffer_ + pos_, &value, 2);
    pos_ += 2;
  }

  void writeString(String value) {
    writeUInt16(value.length());
    memcpy(buffer_ + pos_, value.c_str(), value.length());
    pos_ += value.length();
  }

  size_t getWrittenSize() const {
    return pos_;
  }

private:
  char* buffer_;
  size_t pos_;
};

// Fill binInfoStorage
void generateInfoBinary(uint8_t version) {
  const bool v3 = version >= 3;  // request is for v3 or more
  const bool v4 = version >= 4;  // request is for v4 or more

  const String name = homeCfg.getName();
  const String additionalBlob = homeCfg.getAdditionalBlob();

  //                                                      Sizes of:
  const size_t sz = (v3 ? 2 : 0)                            // response format version (appeared from 3+)
                  + (v4 ? 2 : 0)                            // firmware version (appeared from 4+)
                  + WL_MAC_ADDR_LENGTH                      // MAC
                  + 2 + name.length()                       // name length and name
                  + 1                                       // input pin number
                  + 1 + DIMMERS_COUNT * 9 + (v3 ? 2 : 0)    // dimmers info
                  + 1 + SWITCHERS_COUNT * 3 + (v3 ? 1 : 0)  // switchers info
                  + 2 + additionalBlob.length();            // some App's GUI display settings
  binInfoStorage.resize(sz);

  UnalignedBinarySerializer serializer(binInfoStorage.data());
  if (v4) {
    serializer.writeUInt16(0x0004);
    serializer.writeUInt16(FIRMWARE_VERSION);
  } else if (v3) {
    serializer.writeUInt16(0x0003);
  }
  serializer.writeWiFiMacAddress();
  serializer.writeString(name);
  serializer.writeUInt8(INPUT_PIN);

  serializer.writeUInt8(DIMMERS_COUNT);
  for (uint8_t i = 0; i < DIMMERS_COUNT; ++i) {
    serializer.writeUInt8(DIMMER_PINS[i]);
    serializer.writeUInt16(homeCfg.getDimmerValue(i));
    serializer.writeUInt16(dimmersSettings[i].valueChangeStep);
    serializer.writeUInt16(dimmersSettings[i].minLightnessMicros);
    serializer.writeUInt16(dimmersSettings[i].maxLightnessMicros);
  }
  if (v3) {
    serializer.writeUInt16(homeCfg.getDimmerValueAfterBoot());
  }

