Tsar/smart_home/ESP8266_Firmware/src/main.cpp
  serializer.writeUInt8(SWITCHERS_COUNT);
  for (uint8_t i = 0; i < SWITCHERS_COUNT; ++i) {
    serializer.writeUInt8(SWITCHER_PINS[i]);
    serializer.writeUInt8(homeCfg.getSwitcherValue(i));
    serializer.writeUInt8(homeCfg.isSwitcherInverted(i));
  }
  if (v3) {
    serializer.writeUInt8(homeCfg.getSwitcherValueAfterBoot());
  }

  serializer.writeString(additionalBlob);
}

void handleGetInfo() {
  if (!checkPassword()) return;

  if (server.hasArg("binary")) {
    generateInfoBinary(server.hasArg("v") ? server.arg("v").toInt() : 1);
    server.send(200, "application/octet-stream", binInfoStorage.data(), binInfoStorage.size());
  } else {
    server.send(200, "application/json", generateInfoJson(server.hasArg("minimal")));
  }
}

void handleSetupWiFi() {
  if (!checkPassword()) return;

  if (!server.hasArg("ssid") || !server.hasArg("passphrase")) {
    sendBadRequest();
    return;
  }

  wifiSetupState = WiFiSetupState::IN_PROGRESS;
  server.send(200, "text/plain", "TRYING_TO_CONNECT");
  delay(100);  // задержка нужна, чтобы успеть отправить ответ до попытки
  disconnectWiFi();
  wifiSetupState = connectToWiFi(server.arg("ssid").c_str(), server.arg("passphrase").c_str(), false)
                      ? WiFiSetupState::SUCCESS
                      : WiFiSetupState::FAIL;
  // Если пытаться отправить ответ сервера здесь, то клиент получает ошибку:
  // curl скажет "empty reply from server", android скажет "unexpected end of stream on com.android.okhttp.Address"
}

void handleGetSetupWiFiState() {
  if (!checkPassword()) return;

  String result;
  switch (wifiSetupState) {
    case WiFiSetupState::NONE:
      result = "NONE";
      break;
    case WiFiSetupState::IN_PROGRESS:
      result = "IN_PROGRESS";
      break;
    case WiFiSetupState::FAIL:
      result = "FAIL:" + String(wifiConnectResult);
      break;
    case WiFiSetupState::SUCCESS:
      result = "SUCCESS:" + WiFi.localIP().toString();
      break;
  }
  server.send(200, "text/plain", result);
}

void handleResetWiFi() {
  if (!checkPassword()) return;

  server.send(200, "text/plain", "OK");
  delay(100);
  WiFi.disconnect(true);
  enableAccessPoint();
}

void handleTurnOffAccessPoint() {
  if (!checkPassword()) return;

  server.send(200, "text/plain", "OK");
  delay(100);
  WiFi.softAPdisconnect(true);
  isAccessPointEnabled = false;
}

void handleSetValues() {
  if (!checkPassword()) return;

  bool dimmersChanged = false;
  for (uint8_t i = 0; i < DIMMERS_COUNT; ++i) {
    const String argName = DIMMER_PREFIX + String(i);
    if (server.hasArg(argName)) {
      const int32_t value = server.arg(argName).toInt();
      if (value < 0 || value > DIMMER_MAX_VALUE) {
        sendBadRequest();
        return;
      }
      if (value != homeCfg.getDimmerValue(i)) {
        homeCfg.setDimmerValue(i, value);
        dimmersChanged = true;
      }
    }
  }

  bool switchersChanged = false;
  for (uint8_t i = 0; i < SWITCHERS_COUNT; ++i) {
    const String argName = SWITCHER_PREFIX + String(i);
    if (server.hasArg(argName)) {
      const bool value = server.arg(argName).toInt();
      if (value != homeCfg.getSwitcherValue(i)) {
        homeCfg.setSwitcherValue(i, value);
        switchersChanged = true;
      }
    }
  }

  if (dimmersChanged || switchersChanged) {
    if (dimmersChanged) {
      fillDimmerValues();
    }
    if (switchersChanged) {
      applySwitcherValues();
    }
    server.send(200, "text/plain", "ACCEPTED\n");

    // saving only if saved values will be needed after boot
    if ((dimmersChanged && homeCfg.getDimmerValueAfterBoot() == 0xFFFF) ||
        (switchersChanged && homeCfg.getSwitcherValueAfterBoot() == 0xFF)) {
      homeCfg.asyncSave();
    }
  } else {
    server.send(200, "text/plain", "NOTHING_CHANGED\n");
  }
}

void handleSetSettings() {
  if (!checkPassword()) return;

  if (server.hasArg("name")) {
    homeCfg.setName(server.arg("name"));
  }

  bool resetCfgHappened;
  for (uint8_t i = 0; i < DIMMERS_COUNT; ++i) {
    const String argName = DIMMER_PREFIX + String(i);
    if (server.hasArg(argName)) {
      const String settingsStr = server.arg(argName);
      const int comma1Pos = settingsStr.indexOf(",");
      if (comma1Pos < 0) {
        homeCfg.loadOrReset(resetCfgHappened);  // used to revert cfg
        sendBadRequest();
        return;
      }
      const int comma2Pos = settingsStr.indexOf(",", comma1Pos + 1);
      if (comma2Pos < 0) {
        homeCfg.loadOrReset(resetCfgHappened);  // used to revert cfg
        sendBadRequest();
        return;
      }
      smart_home::DimmerSettings settings;
      settings.valueChangeStep = settingsStr.substring(0, comma1Pos).toInt();
      settings.minLightnessMicros = settingsStr.substring(comma1Pos + 1, comma2Pos).toInt();
      settings.maxLightnessMicros = settingsStr.substring(comma2Pos + 1).toInt();
      if (!settings.areValid()) {
        homeCfg.loadOrReset(resetCfgHappened);  // used to revert cfg
        sendBadRequest();
        return;
      }
      homeCfg.setDimmerSettings(i, settings);
    }
  }

  for (uint8_t i = 0; i < SWITCHERS_COUNT; ++i) {
    const String argName = SWITCHER_PREFIX + String(i);
    if (server.hasArg(argName)) {
      const bool inverted = server.arg(argName).toInt();
      if (homeCfg.isSwitcherInverted(i) != inverted) {
        homeCfg.setSwitcherInverted(i, inverted);
        homeCfg.setSwitcherValue(i, !homeCfg.getSwitcherValue(i));
      }
    }
  }

  if (server.hasArg("dvab")) {
    homeCfg.setDimmerValueAfterBoot(server.arg("dvab").toInt());
  }
  if (server.hasArg("svab")) {
    homeCfg.setSwitcherValueAfterBoot(server.arg("svab").toInt());
  }

  if (server.hasArg("blob")) {
    homeCfg.setAdditionalBlob(server.arg("blob"));
  }

  homeCfg.save();
  server.send(200, "text/plain", "ACCEPTED\n");
}

void handleSetPassword() {
  if (!checkPassword()) return;

  if (!server.hasArg("password")) {
    sendBadRequest();
    return;
  }

  homeCfg.setPassword(server.arg("password"));
  homeCfg.save();
  updateServer.updateCredentials(UPDATER_USERNAME, homeCfg.getPassword());

  server.send(200, "text/plain", "ACCEPTED\n");
}

