Tsar/smart_home/ESP8266_Firmware/src/main.cpp
void handleSendToUart() {
  if (!server.hasArg("plain")) {
    sendBadRequest();
    return;
  }

  Serial.print(server.arg("plain"));
  server.send(200, "text/plain", "OK\n");
}

void handleNotFound() {
  server.send(404, "text/plain", "Not Found");
}

void udpHandlePacket() {
  int packetSize = udp.parsePacket();
  if (packetSize == static_cast<int>(UDP_SCAN_REQUEST.length())) {
    int len = udp.read(udpInputBuffer, packetSize);
    udpInputBuffer[len] = 0;
    if (UDP_SCAN_REQUEST == String(udpInputBuffer)) {
      const String response = "MAC=" + WiFi.macAddress() + "\nNAME=" + homeCfg.getName();
      udp.beginPacket(udp.remoteIP(), UDP_RESPONSE_PORT);  // unicast back
      udp.write(response.c_str());
      udp.endPacket();
    }
  }
}

void resetWiFiResetSequence() {
  homeCfg.setWiFiResetSequenceLengthAndSave(0);
}

void incrementWiFiResetSequence() {
  const uint8_t currentSeqLength = homeCfg.getWiFiResetSequenceLength();
  homeCfg.setWiFiResetSequenceLengthAndSave(currentSeqLength + 1);

  const auto currentUptime = millis();

  const uint32_t resetSeqLengthUptime = WIFI_RESET_SEQUENCE[currentSeqLength] * 1.2;
  if (resetSeqLengthUptime >= currentUptime) {
    wifiResetSequenceDetectorTicker.once_ms(resetSeqLengthUptime - currentUptime, resetWiFiResetSequence);
  } else {
    resetWiFiResetSequence();
  }
}

// Проверка и обработка кодовой последовательности продолжительности включений контроллера для сброса настроек wi-fi
void checkWiFiResetSequence() {
  const uint8_t currentSeqLength = homeCfg.getWiFiResetSequenceLength();
  if (currentSeqLength >= WIFI_RESET_SEQUENCE.size()) {
    homeCfg.setPassword(DEFAULT_HTTP_PASSWORD);  // пароль для HTTP тоже сбрасываем, чтобы можно было добавить устройство как свежее
    homeCfg.setWiFiResetSequenceLengthAndSave(0);

    WiFi.disconnect(true);

    // Поморгать встроенным светодиодом 5 раз
    for (uint8_t i = 0; i < 5; ++i) {
      digitalWrite(LED_BUILTIN, HIGH);
      delay(60);
      digitalWrite(LED_BUILTIN, LOW);
      delay(60);
    }
  } else {
    const auto currentUptime = millis();
    const uint32_t incrementSeqLengthUptime = WIFI_RESET_SEQUENCE[currentSeqLength] * 0.8;
    if (incrementSeqLengthUptime >= currentUptime) {
      const uint32_t interval = incrementSeqLengthUptime - currentUptime;
      wifiResetSequenceDetectorTicker.once_ms(interval, incrementWiFiResetSequence);
    }
  }
}

void setup() {
  for (uint8_t i = 0; i < DIMMERS_COUNT; ++i) {
    pinMode(DIMMER_PINS[i], OUTPUT);
    digitalWrite(DIMMER_PINS[i], LOW);
  }
  for (uint8_t i = 0; i < SWITCHERS_COUNT; ++i) {
    pinMode(SWITCHER_PINS[i], OUTPUT);
  }

  bool resetCfgHappened;
  homeCfg.loadOrReset(resetCfgHappened);

  initCfgDimmerValuesAfterBoot();
  initCfgSwitcherValuesAfterBoot();

  dimmersSettings = homeCfg.getDimmersSettings();
  fillDimmerValues();
  createEventsQueue();
  applySwitcherValues();

  timer1_attachInterrupt(onTimerISR);
  timer1_enable(TIM_DIV16, TIM_EDGE, TIM_SINGLE);

  pinMode(INPUT_PIN, INPUT);
  attachInterrupt(digitalPinToInterrupt(INPUT_PIN), onInputFall, FALLING);

  pinMode(LED_BUILTIN, OUTPUT);
  digitalWrite(LED_BUILTIN, LOW);

  Serial.begin(115200);

  checkWiFiResetSequence();

  WiFi.persistent(true);
  WiFi.setAutoConnect(false);
  WiFi.setAutoReconnect(true);

  // Не используем WiFi.disconnect и WiFi.softAPdisconnect, чтобы не трогать сохранённые настройки, а то reset в неподходящий момент всё портит
  disconnectWiFi();
  WiFi.enableAP(false);
  isAccessPointEnabled = false;

  // This should partly help for quick responses, details: https://github.com/esp8266/Arduino/issues/6886
  WiFi.setSleepMode(WIFI_NONE_SLEEP);

  station_config stationCfg;
  wifi_station_get_config_default(&stationCfg);
  const char* cfgSsid = reinterpret_cast<char*>(stationCfg.ssid);
  const char* cfgPassphrase = reinterpret_cast<char*>(stationCfg.password);

  if (strlen(cfgSsid) > 0) {
    connectToWiFi(cfgSsid, cfgPassphrase, true);
  } else {
    enableAccessPoint();
  }

  server.on("/get_info", HTTP_GET, handleGetInfo);
  server.on("/setup_wifi", HTTP_POST, handleSetupWiFi);
  server.on("/get_setup_wifi_state", HTTP_GET, handleGetSetupWiFiState);
  server.on("/reset_wifi", HTTP_GET, handleResetWiFi);
  server.on("/turn_off_ap", HTTP_GET, handleTurnOffAccessPoint);
  server.on("/set_values", HTTP_ANY, handleSetValues);
  server.on("/set_settings", HTTP_POST, handleSetSettings);
  server.on("/set_password", HTTP_POST, handleSetPassword);
  server.on("/send2uart", HTTP_POST, handleSendToUart);
  server.onNotFound(handleNotFound);

  const char* headerKeys[] = {"Password"};
  server.collectHeaders(headerKeys, 1);

  updateServer.setup(&server, "/fw_update", UPDATER_USERNAME, homeCfg.getPassword());

  server.begin();
}

void loop() {
  server.handleClient();
  udpHandlePacket();
}
